lllucius/DECtalk_ESPress/sdkconfig.defaults
# SPDX-License-Identifier: MIT
# Copyright (c) 2025 Leland Lucius

# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.2 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=8192
CONFIG_TINYUSB_CDC_ENABLED=y
